src/Catalogs/ММ_ШаблоныСообщений/ММ_ШаблоныСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ММ_ШаблоныСообщений</name>
  <attributes>
    <name>ТекстШаблонаTelegram</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблонаОтправкиEmail</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидШаблона</name>
    <type>
      <types>CatalogRef.ММ_ВидыШаблоновОтправкиСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблонаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыСообщения</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ММ_ШаблоныСообщений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить сообщения.
// 
// Параметры:
//  Ссылка - СправочникСсылка.ММ_ШаблоныСообщений - Ссылка
//  ПараметрыЗаполнения - Структура - Параметры заполнения
// 
// Возвращаемое значение:
//  Структура - Получить сообщения:
// * Телеграм - Строка - 
// * СообщениеHTML - Строка - 
// * Тема - Строка - 
// * Битрикс - Строка - 
Функция ПолучитьСообщения(Ссылка, ПараметрыЗаполнения) Экспорт

	СтруктураВозврата = Новый Структура;

	СтруктураВозврата.Вставить("Телеграм", "");
	СтруктураВозврата.Вставить("СообщениеHTML", "");
	СтруктураВозврата.Вставить("Тема", "");
	СтруктураВозврата.Вставить("Битрикс", "");

	РеквизитыШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
																  "ТекстШаблонаTelegram,ТекстШаблонаОтправкиEmail,ЗаголовокПисьма,ТекстШаблонаBitrix,ПараметрыСообщения");
	ТаблицаРеквизитов = РеквизитыШаблона.ПараметрыСообщения.Выгрузить();
	Для Каждого Реквизит Из ТаблицаРеквизитов Цикл
		ИмяПараметра = Реквизит.ИмяПараметра;

		Если ПараметрыЗаполнения.Свойство(ИмяПараметра) Тогда
			НовоеЗначение = ПараметрыЗаполнения[ИмяПараметра];
		Иначе
			НовоеЗначение = "";
		КонецЕсли;
		РеквизитыШаблона.ТекстШаблонаTelegram 		= СтрЗаменить(РеквизитыШаблона.ТекстШаблонаTelegram, "[" + ИмяПараметра
			+ "]", НовоеЗначение);

		РеквизитыШаблона.ТекстШаблонаОтправкиEmail 	= СтрЗаменить(РеквизитыШаблона.ТекстШаблонаОтправкиEmail, "[" + ИмяПараметра
			+ "]", НовоеЗначение);

		РеквизитыШаблона.ЗаголовокПисьма 			= СтрЗаменить(РеквизитыШаблона.ЗаголовокПисьма, "[" + ИмяПараметра
			+ "]", НовоеЗначение);

		РеквизитыШаблона.ТекстШаблонаBitrix 		= СтрЗаменить(РеквизитыШаблона.ТекстШаблонаBitrix, "[" + ИмяПараметра
			+ "]", НовоеЗначение);
	КонецЦикла;

	СтруктураВозврата.Телеграм 		= РеквизитыШаблона.ТекстШаблонаTelegram;
	СтруктураВозврата.СообщениеHTML = РеквизитыШаблона.ТекстШаблонаОтправкиEmail;
	СтруктураВозврата.Тема 			= РеквизитыШаблона.ЗаголовокПисьма;
	СтруктураВозврата.Битрикс 		= РеквизитыШаблона.ТекстШаблонаBitrix;

	Возврат СтруктураВозврата;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
